readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-20 Thu 22:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Readme</title>
<meta name="author" content="Alexander Derevianko" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Readme</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4e2af8b">1. Setup</a></li>
<li><a href="#orge7e22fd">2. Installation</a></li>
<li><a href="#org3a95a5c">3. Afterword</a></li>
</ul>
</div>
</div>
<p>
Hi there!
How did you find this repo?
You either me and want to install belowed NixOS on new system or you are very lost and need to get back to normal Linux distribuions as fast as possible while you can, don&rsquo;t try to help, leave me here, now I can&rsquo;t return to normal people, it is too late.
If you are still here then lets discuss my setup.
</p>
<div id="outline-container-org4e2af8b" class="outline-2">
<h2 id="org4e2af8b"><span class="section-number-2">1.</span> Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
Currently I&rsquo;m using nixos-unstable with flake based configuration.
As my primary maching is laptop - all links will be pointing to it.
I try to keep vm configs up to date, but as it is not used I rarely actually do it.
</p>

<p>
Installed packages
</p>
<ul class="org-ul">
<li>Hyprland
Is Wayland dynamic tiling compositor
<ul class="org-ul">
<li><a href="machines/laptop/nixos-modules/hypr.nix">nixos configs</a></li>
<li><a href="modules/rice/my/hypr/default.nix">home-manager</a></li>
</ul></li>
<li>Stylix
Used to customize theming across system
<ul class="org-ul">
<li><a href="machines/laptop/default.nix">nixos configs</a> - search for stylix</li>
<li><a href="machines/laptop/home.nix">home-manager</a> - seach for stylix</li>
</ul></li>
<li>Alacritty</li>
<li>Browsers
There are some options that can be enabled using `dov.browser.{browserName} = true;`
Available options:
<ol class="org-ol">
<li>Firefox</li>
<li>Qutebrowser</li>
<li>Chrome</li>
<li>Brave</li>
<li>Vivaldi</li>
</ol></li>
<li>Filemanager
I use ranger for terminal and thunar for GUI option</li>
</ul>
</div>
</div>


<div id="outline-container-orge7e22fd" class="outline-2">
<h2 id="orge7e22fd"><span class="section-number-2">2.</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Create installation flashdrive with latest iso using this command
</p>
<div class="org-src-container">
<pre class="src src-bash">  <span style="color: #fabd2f;">sudo</span> dd <span style="color: #83a598;">bs</span>=4M <span style="color: #83a598;">conv</span>=fsync <span style="color: #83a598;">oflag</span>=direct <span style="color: #83a598;">status</span>=progress <span style="color: #83a598;">if</span>=&lt;path-to-image&gt; <span style="color: #83a598;">of</span>=/dev/sdX
</pre>
</div></li>
<li>Install using gui installation tool (in future perhaps I will create nixos config for it)</li>
<li>Add ssh files from backups</li>
<li><p>
Clone this repo
</p>
<div class="org-src-container">
<pre class="src src-bash">  <span style="color: #fabd2f;">git</span> clone <span style="color: #fabd2f;">git</span>@github.com:LichHunter/nixos-dotfiles.git
</pre>
</div></li>
<li><p>
Run command to install configuration
In this case I&rsquo;m running boot option as there are a bunch of packages (around 20G was) to be installed and this can break smth if run switch
`nixos-boot` == `sudo nixos-rebuild boot &#x2013;flake ~/nixos-dotfiles#laptop`
</p>
<div class="org-src-container">
<pre class="src src-bash">  nixos-boot
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org3a95a5c" class="outline-2">
<h2 id="org3a95a5c"><span class="section-number-2">3.</span> Afterword</h2>
<div class="outline-text-2" id="text-3">
<p>
There is also <a href="wiki.html">wiki.org</a> file that contains some commands that can be used
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Derevianko</p>
<p class="date">Created: 2024-06-20 Thu 22:50</p>
</div>
</body>
</html>
